# LightType Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LightType Properties
LightType Class See Also
---
The LightType type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ColorFilter | The light filter color. |
| DimmingColor | The dimming temperature value in Kelvins. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
LightType Class
Autodesk.Revit.DB.Lighting Namespace